import numpy as np
import pandas as pd
b = pd.read_csv('../../../my_data/multi_price.csv', index_col=0)
print(b.head())
#             AJ네트웍스   AJ렌터카    AK홀딩스      BGF  ...    DB하이텍  DGB금융지주    DRB동일     DSR
# date_time                                     ...
# 2017-01-02  6500.0  8330.0  53100.0  41780.0  ...  16300.0   9650.0  11899.0  9350.0
# 2017-01-03  6500.0  8320.0  52100.0  42811.0  ...  17250.0   9600.0  11704.0  9200.0
# 2017-01-04  6500.0  8310.0  51100.0  42089.0  ...  17700.0   9760.0  12143.0  9080.0
# 2017-01-05  6500.0  8490.0  51900.0  43171.0  ...  17950.0   9740.0  12386.0  9030.0
# 2017-01-06  6500.0  8400.0  52100.0  43532.0  ...  18450.0   9820.0  12338.0  8730.0
#
# [5 rows x 20 columns]

momentum_series = b.loc["2018-08-09"] / b.loc["2017-08-09"] - 1
print(momentum_series.nlargest(3))
# [5 rows x 20 columns]
# DB        0.141678
# DB금융투자    0.118421
# CJ헬로      0.087822
# dtype: float64

